In [8]:
import numpy as np
import pandas as pd

**read_csv:** Load delimited data from a file, URL, or file-like object; use comma as default delimiter<br>
**read_table:** Load delimited data from a file, URL, or file-like object; use tab ('\t') as default delimiter<br>
**read_fwf:** Read data in fixed-width column format (i.e., no delimiters)<br>
**read_clipboard:** Version of read_table that reads data from the clipboard; useful for converting tables from web
pages<br>
**read_excel:** Read tabular data from an Excel XLS or XLSX file<br>
**read_hdf:** Read HDF5 files written by pandas<br>
**read_html:** Read all tables found in the given HTML document<br>
**read_json:**. Read data from a JSON (JavaScript Object Notation) string representation<br>
**read_msgpack:** Read pandas data encoded using the MessagePack binary format<br>
**read_pickle:** Read an arbitrary object stored in Python pickle format<br>

In [9]:
# !type

In [10]:
!type ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [11]:
df = pd.read_csv("ex1.csv")

In [12]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
# or we can use pd.read_table(..., sep = ",")

In [14]:
pd.read_table("ex1.csv", sep=",")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [15]:
# In ex2.csv without no header

In [16]:
# we can deal this problem with header = None

In [17]:
!type ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [19]:
pd.read_csv("ex2.csv") # no header

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [20]:
pd.read_csv("ex2.csv",header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [25]:
pd.read_csv("ex2.csv", names = ["a","b","c","d","message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [27]:
pd.read_csv("ex2.csv", names = ["a","b","c","d","message"],index_col = "message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [28]:
# Read book later